
#Напишите программу, которая проверяет, кипит ли вода.
#Примите целочисленную температуру в градусах Цельсия в качестве входных данных и выведите "Кипение", если температура выше или равна 100.
temp = int(input())
if temp >= 100:
    print("Boiling")