# Вы создаете datepicker для веб-сайта, и вам нужно вывести все годы за определенный период.
# Напишите программу, которая принимает два целых числа в качестве входных данных и выводит диапазон чисел между двумя входными данными в виде списка.
# Последовательность вывода должна начинаться с первого входного номера и заканчиваться вторым входным номером, не включая его.

letters = ['x', 'y', 'z']
letters.insert(1, 'w')
print(letters)